{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
      "input_layers": [
        [
          "input_1",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              11
            ],
            "dtype": "float32",
            "name": "input_1",
            "ragged": false,
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input_1"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "tanh",
            "activity_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 9.999999747378752e-05,
                "l2": 0.0
              }
            },
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {
                "dtype": "float32"
              }
            },
            "bias_regularizer": null,
            "dtype": "float32",
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "dtype": "float32",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_1",
            "trainable": true,
            "units": 6,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_1"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {
                "dtype": "float32"
              }
            },
            "bias_regularizer": null,
            "dtype": "float32",
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "dtype": "float32",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_2",
            "trainable": true,
            "units": 3,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dense_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_2"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "tanh",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {
                "dtype": "float32"
              }
            },
            "bias_regularizer": null,
            "dtype": "float32",
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "dtype": "float32",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_3",
            "trainable": true,
            "units": 3,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dense_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_3"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {
                "dtype": "float32"
              }
            },
            "bias_regularizer": null,
            "dtype": "float32",
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "dtype": "float32",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_4",
            "trainable": true,
            "units": 11,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dense_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_4"
        }
      ],
      "name": "model_1",
      "output_layers": [
        [
          "dense_4",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.2.4-tf"
  },
  "hash": "ccd84d73ba376f0c0ace31b3a7c8b4e23b3925779c65f175b5f3b864c673d901",
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      11
    ]
  ],
  "output_shapes": [
    [
      11
    ]
  ],
  "tests": [
    {
      "inputs": [
        {
          "shape": [
            11
          ],
          "values": [
            "g3YGP4txBL9depI/yr6EP1bUFr/sswzA/b8xvvi7Mb+Tte0+TfY6vteJkb4="
          ]
        }
      ],
      "outputs": [
        {
          "shape": [
            11
          ],
          "values": [
            "XEPHPgAAAAAAAAAAAAAAAAAAAACn/K4+AAAAAAAAAACUzkY9AAAAAAAAAAA="
          ]
        }
      ]
    }
  ],
  "trainable_params": {
    "dense_1": {
      "bias": [
        "G9lLOaRmlrt4aDe4jvpHuccA4jd8N7i4"
      ],
      "weights": [
        "IO4AO1eFPTxmz4u6KaudvD6TRji3yHw7y8VvuPGNhjyUn7a5405wPOip5LZuTLA4kBYbPnk6pT28kqs9BRgRPnmdgD4fKKQ9SjkEO4WrlboT67+6Px0KOiJH9DhWyQ47auRgu16+jrnkxak5SIlHOY3GwDjjlNK6AlOaPiw2IT4w8Dc+NUKRPlkoAj96ciE+KuUBPssUm7zHd6y92b5RPIuTjjkjK2k+A79vvMU1LLsKPWq7SHBKuzijvDdIuEQ7vzOaPWnduD2MRoY+KNzDPYms0z031ny+f6KYvtOzHb7t4CW+SMSOvkY+AL9/2iy+OGrBuxiGyLpNiRY8eDE2O/+j+zkXm5E8"
      ]
    },
    "dense_2": {
      "bias": [
        "+Tw7PrV0Wj0dE/Y9"
      ],
      "weights": [
        "tLJsvx/RpD69Xt8/h7IhwK28CkAXBDjAc4jjPxf3Pj9WqdC9J7cDwHucOMCOyJG/1FqNP8Yipz4/DYs/rtHAv/PXNT/JW8U/"
      ]
    },
    "dense_3": {
      "bias": [
        "Je8Dv5y+jj7YPBu+"
      ],
      "weights": [
        "/Vf7P9xKRL9KPOa+NBdlvhYEIsBYC0NAedACQOjuzz7QgRy9"
      ]
    },
    "dense_4": {
      "bias": [
        "P5TcPnf+4z44rE29Pi1Jvs4whb4RAw69UWq7uyf2Fr6h7ia+JEv9vcseIzw="
      ],
      "weights": [
        "CZSDvrB9ZMDzItW+zF0RPr0OMj5f88m9b8BtPtcJhL6ZcLK+tw+0PbzPMrs3AgjAULoVPzYoej7c8LQ+Bx6IvY3Hqb6SoIk/cjQ9Ppy3577O0gk/98y3O9/dDEAs41M++3Q3Piml6L0fzUE9mUXOvo5Lbj/lxKA+VKrIvkFaLj7QVwQ8"
      ]
    }
  }
}
