{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
      "input_layers": [
        [
          "input_10",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              4
            ],
            "dtype": "float32",
            "name": "input_10",
            "ragged": false,
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input_10"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "tanh",
            "activity_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 9.999999747378752e-05,
                "l2": 0.0
              }
            },
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {
                "dtype": "float32"
              }
            },
            "bias_regularizer": null,
            "dtype": "float32",
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "dtype": "float32",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_34",
            "trainable": true,
            "units": 6,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "input_10",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_34"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {
                "dtype": "float32"
              }
            },
            "bias_regularizer": null,
            "dtype": "float32",
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "dtype": "float32",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_35",
            "trainable": true,
            "units": 3,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dense_34",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_35"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "tanh",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {
                "dtype": "float32"
              }
            },
            "bias_regularizer": null,
            "dtype": "float32",
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "dtype": "float32",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_36",
            "trainable": true,
            "units": 3,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dense_35",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_36"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {
                "dtype": "float32"
              }
            },
            "bias_regularizer": null,
            "dtype": "float32",
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "dtype": "float32",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_37",
            "trainable": true,
            "units": 4,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dense_36",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_37"
        }
      ],
      "name": "model_10",
      "output_layers": [
        [
          "dense_37",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.2.4-tf"
  },
  "hash": "d02203bc16668bda0d97155f5c99a8a9aeb4fe3080df95ab2f1c7ab095e5a6de",
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      4
    ]
  ],
  "output_shapes": [
    [
      4
    ]
  ],
  "tests": [
    {
      "inputs": [
        {
          "shape": [
            4
          ],
          "values": [
            "OAZvP85Rgr/yhC2+lqtcPw=="
          ]
        }
      ],
      "outputs": [
        {
          "shape": [
            4
          ],
          "values": [
            "zjKwPwAAAAAAAAAAAAAAAA=="
          ]
        }
      ]
    }
  ],
  "trainable_params": {
    "dense_34": {
      "bias": [
        "4H0eOTkegLk2rQk4rAAQufjJgjnyBGc6"
      ],
      "weights": [
        "p4bqunh6G7csjiW9XCt2PVPX6jneGp09dbKDuacjj7rc2Bk969KBvV6VJTl9DIw9vSfGum+dIbrAqWY6Gry7uQaeVzlwNhq4xS8xvEOMH7tfdx+61l+EPHUtFzw4XoA9"
      ]
    },
    "dense_35": {
      "bias": [
        "B/1VPbv9Sj2sTqG+"
      ],
      "weights": [
        "0qmSPTPDCz79k6W+wfufueiM8jvWWVq8rEGNv9R67z7AhbW+P8ZcPzhLhr8BUk2+8j4LvM3IVrwUgxM9rwCvPyeBiD/NYYQ/"
      ]
    },
    "dense_36": {
      "bias": [
        "csEbvlsHUT3Q7ww/"
      ],
      "weights": [
        "HuTHvrqkYr+SrKW/v+zPP2D9gD+5LI6/DaOmP8LABL9tedC/"
      ]
    },
    "dense_37": {
      "bias": [
        "qriQP4TtTj98rby+uZ+Ivg=="
      ],
      "weights": [
        "0FwXvpSXAkBRWay+htwRv0TCDcC4hLk/yXPzviPLLr7u+SLAoK3fv10ZBz92Gro+"
      ]
    }
  }
}
