{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
      "input_layers": [
        [
          "input_1",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              11
            ],
            "dtype": "float32",
            "name": "input_1",
            "ragged": false,
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input_1"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "tanh",
            "activity_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 9.999999747378752e-05,
                "l2": 0.0
              }
            },
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {
                "dtype": "float32"
              }
            },
            "bias_regularizer": null,
            "dtype": "float32",
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "dtype": "float32",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_1",
            "trainable": true,
            "units": 6,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_1"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {
                "dtype": "float32"
              }
            },
            "bias_regularizer": null,
            "dtype": "float32",
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "dtype": "float32",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_2",
            "trainable": true,
            "units": 3,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dense_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_2"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "tanh",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {
                "dtype": "float32"
              }
            },
            "bias_regularizer": null,
            "dtype": "float32",
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "dtype": "float32",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_3",
            "trainable": true,
            "units": 3,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dense_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_3"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {
                "dtype": "float32"
              }
            },
            "bias_regularizer": null,
            "dtype": "float32",
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "dtype": "float32",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_4",
            "trainable": true,
            "units": 11,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dense_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_4"
        }
      ],
      "name": "model_1",
      "output_layers": [
        [
          "dense_4",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.2.4-tf"
  },
  "hash": "456dbbd087416bdcdb383528d89604830421456f692922de989951bf94d0fa72",
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      11
    ]
  ],
  "output_shapes": [
    [
      11
    ]
  ],
  "tests": [
    {
      "inputs": [
        {
          "shape": [
            11
          ],
          "values": [
            "W17APh4t1L8uUwlALDdSP0PGhb5q1Y4+mHT3Pjnatz9ZAvI/eB5Fv98PDz8="
          ]
        }
      ],
      "outputs": [
        {
          "shape": [
            11
          ],
          "values": [
            "soQYP7idND8AAAAAMBmKPTkiCT41OBc/4QAnP2L2HT4AAAAAm92cPgAAAAA="
          ]
        }
      ]
    }
  ],
  "trainable_params": {
    "dense_1": {
      "bias": [
        "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA"
      ],
      "weights": [
        "R/0Lv3AMaz52gWW+gGSXPMMDyr541MY9ttx/vlQHML7aBIc+m0/ovqBUjT6iqJ0+XCQ6vlNUk74Ebmi+okfLvrCR4D6g2MA9uIARP7DxCD7MJWO+mnWAPgpwc74IDry9poIHv7AmAD+o2Dw+luJTvhzIK77sCwi/eZiUviSYBj7A2QY9Uttvvvg2lT78rRa+pIJ1PpZzFr+eD5M+iHzhPQBlaTsmhBK+IN6pvBAnBj8S7QE/rDMYvoDhBTwSy8w+QK8IvFCshb0GRxG+nCTyvhiivb2W4BC/gPf2Pqrt9b6ANCI8TKgdvm4+hb7Izfa+Y4oLv3ynYD50Zu4+Cg+nPgBWF71kKFs+"
      ]
    },
    "dense_2": {
      "bias": [
        "AAAAAAAAAAAAAAAA"
      ],
      "weights": [
        "6lKWvnjLTj8wITe+Pqsiv7h26D5Ajxg/rEOIvsxDsz60tSu/kGKYvdDhgD7P1zO/OEc2P86kN7/+DRy/QjKwvsjqAT9Y0uO9"
      ]
    },
    "dense_3": {
      "bias": [
        "AAAAAAAAAAAAAAAA"
      ],
      "weights": [
        "XCwTP5SESr9wlU2/pMdcPxyFML8scGA/kIplP1jr8754rcc+"
      ]
    },
    "dense_4": {
      "bias": [
        "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA="
      ],
      "weights": [
        "cukcP3zzID/euQa/+AGRPSqVpr7gy5s+PFwIP2g0ij7LQB6/+BJCPoCXCjxIcKy9JQqKvk4cvr7wzQG+uCAIv696D7/6tuS+WJqOvdNvmr4PXAm/wAl2PlLjFT8YERw/SL3UPS5Ub76EzvU+QIDoPpj8dD5lebm+SIVoPt+E/b44wPg9"
      ]
    }
  }
}
